#+TITLE: Intro to Java Programming
#+AUTHOR: Scott Runnels
#+LANGUAGE: en
#+EXPORT_FILE_NAME: part01e.pdf
#+OPTIONS:   H:2 num:t toc:t \n:nil @:t ::t |:t ^:nil -:nil f:t *:t <:t 
#+BIND: org-latex-caption-above nil
#+LaTeX_CLASS: beamer
#+LaTeX_CLASS_OPTIONS: [presentation]
#+COLUMNS: %45ITEM %10BEAMER_env(Env) %10BEAMER_act(Act) %4BEAMER_col(Col) %8BEAMER_opt(Opt)
#+COLUMNS: %20ITEM %13BEAMER_env(Env) %6BEAMER_envargs(Args) %4BEAMER_col(Col) %7BEAMER_extra(Extra)
#+BEAMER_THEME: metropolis
#+BEAMER_OUTER_THEME: miniframes [subsection=false]
#+BEAMER_HEADER: \subtitle{Calculating with Numbers}
#+BEAMER_HEADER: \AtBeginSection[]{
# This line inserts a table of contents with the current section highlighted at
# the beginning of each section
#+BEAMER_HEADER: \begin{frame}<beamer>\frametitle{Topic}\tableofcontents[currentsection]\end{frame}
# In order to have the miniframes/smoothbars navigation bullets even though we do not use subsections 
# q.v. https://tex.stackexchange.com/questions/2072/beamer-navigation-circles-without-subsections/2078#2078
#+BEAMER_HEADER: \subsection{}
#+BEAMER_HEADER: }
#+LATEX_HEADER: \definecolor{myblue}{RGB}{20,105,176}
#+LATEX_HEADER: \usepackage{listings}
#+LATEX_HEADER: \usepackage{minted}
#+LATEX_HEADER: \usepackage[listings, many]{tcolorbox}
#+LATEX_HEADER: \usepackage{etoolbox}
#+LATEX_HEADER: \usepackage{local-style}
#+LATEX_HEADER: \BeforeBeginEnvironment{minted}{\begin{tcolorbox}[enhanced,colframe=myblue,boxrule=1pt,boxsep=1pt,left=1pt,right=1pt,top=-0pt,bottom=0pt,arc=0pt,toprule=0pt, rightrule=0pt,colback=white,attach boxed title to top left={yshift=-0pt},title=Code,boxed title style={colback=myblue, right=0mm, bottomrule=0pt, left=0mm, arc=0pt}, fonttitle=\tiny]}%
#+LATEX_HEADER: \AfterEndEnvironment{minted}{\end{tcolorbox}}%
#+LATEX_HEADER: \usepackage{parskip}
*** Parenthesis are an easy way to control flow of operations
   #+ATTR_LATEX: :options numbersep=5pt,linenos,breaklines=true,fontsize=\tiny
    #+begin_src java  :exports both :wrap resultscode :cache yes
      int calculationWithParens = (1 + 1) + 3 * (2 + 5);
      System.out.println(calculationWithParens);

      int calculationWithoutParens = 1 + 1 + 3 * 2 + 5;
      System.out.println(calculationWithoutParens);
    #+end_src

    #+RESULTS[90836f8f768f867e89ca9d2aeb0942c598c6ff4c]:
    #+begin_resultscode
    23
    13
    #+end_resultscode

*** Creating new strings with =+=                                     :BMCOL:
    :PROPERTIES:
    :BEAMER_opt: t
    :BEAMER_env: onlyenv
    :BEAMER_act: <1>
    :END:
   #+ATTR_LATEX: :options numbersep=5pt,linenos,breaklines=true,fontsize=\tiny
    #+begin_src java :exports both :wrap resultscode :cache yes
      String sampleString = "The answer to everything is " + 42;
      System.out.println(sampleString);
    #+end_src

    #+RESULTS[647344faf9faa82e77089ad91dabf276e70eb924]:
    #+begin_resultscode
    The answer to everything is 42
    #+end_resultscode

*** Creating new strings with =+=                                     :BMCOL:
    :PROPERTIES:
    :BEAMER_opt: t
    :BEAMER_env: onlyenv
    :BEAMER_act: <2>
    :END:

   #+ATTR_LATEX: :options numbersep=5pt,linenos,breaklines=true,fontsize=\tiny
    #+begin_src java :exports both :wrap resultscode :cache yes
      String sampleString = "The answer to everything is " + 42;
      System.out.println(sampleString);
    #+end_src

    #+RESULTS[647344faf9faa82e77089ad91dabf276e70eb924]:
    #+begin_resultscode
    The answer to everything is 42
    #+end_resultscode
   #+ATTR_LATEX: :options numbersep=5pt,linenos,breaklines=true,fontsize=\tiny
    #+begin_src java :exports both :wrap resultscode :cache yes
      System.out.println("Four: " + (2 + 2));
      System.out.println("But! Twenty-two: " + 2 + 2);
    #+end_src

    #+RESULTS[b975dc52811d151040542e3b3cb4250c9d797a45]:
    #+begin_resultscode
    Four: 4
    But! Twenty-two: 22
    #+end_resultscode

*** Integer dividend and divisor result in integer quotients        :B_block:
    #+LaTeX: {\tiny
    Integer divided by integer results in an integer
    #+LaTeX: }    
   #+ATTR_LATEX: :options numbersep=5pt,linenos,breaklines=true,fontsize=\tiny
    #+begin_src java :exports both :wrap resultscode :cache yes
      int result = 3 / 2; 
      System.out.println(result);
    #+end_src

    #+RESULTS[a131390fb77b46f4464e356f71484194865c24f4]:
    #+begin_resultscode
    1
    #+end_resultscode

   #+ATTR_LATEX: :options numbersep=5pt,linenos,breaklines=true,fontsize=\tiny
    #+begin_src java :exports both :wrap resultscode :cache yes
      int dividend = 2;
      int divisor = 3;
      double quotient = divisor / dividend;
      System.out.println(quotient);
    #+end_src

    #+RESULTS[203da20f28036d005840c9db0443a55a8f734d33]:
    #+begin_resultscode
    1.0
    #+end_resultscode
*** A double results in greater precision
    #+ATTR_LATEX: :options numbersep=5pt,linenos,breaklines=true,fontsize=\tiny
    #+begin_src java :exports both :wrap resultscode :cache yes
      double dividend = 2.0;
      int divisor = 3;
      double quotient = divisor / dividend;
      System.out.println(quotient);
    #+end_src

    #+RESULTS[caa97ca456677d32bd60d04582ece11604c925ff]:
    #+begin_resultscode
    1.5
    #+end_resultscode

**** 
    :PROPERTIES:
    :BEAMER_opt: T
    :BEAMER_col: 0.50
    :END:

    #+LaTeX: {\tiny
    #+ATTR_LATEX: :options numbersep=5pt,linenos,breaklines=true,fontsize=\tiny
    #+begin_src java :exports both :wrap resultscode :cache yes
      int divisor = 3;
      int dividend = 2;

      double result1 = (double) divisor / dividend;
      System.out.println(result1);
      double result2 =  divisor / (double) dividend;
      System.out.println(result2);
      double result3 = (double) (divisor / dividend);
      System.out.println(result3);
    #+end_src

    #+RESULTS[af5c00ad1e0949891b3b22089b72c5836df47d77]:
    #+begin_resultscode
    1.5
    1.5
    1.0
    #+end_resultscode
**** 
    :PROPERTIES:
    :BEAMER_opt: T
    :BEAMER_col: 0.50
    :END:

       #+ATTR_LATEX: :options numbersep=5pt,linenos,breaklines=true,fontsize=\tiny
    #+begin_src java :exports both :wrap resultscode :cache yes
      int dividend = 3;
      int divisor = 2;

      double result = 1.0 * dividend / divisor;
      System.out.println(result);
    #+end_src

    #+RESULTS[504f320c6ff92a51bb4776e517da361ffed4b8c7]:
    #+begin_resultscode
    1.5
    #+end_resultscode
   #+ATTR_LATEX: :options numbersep=5pt,linenos,breaklines=true,fontsize=\tiny
    #+begin_src java  :exports both :wrap resultscode :cache yes
      int dividend = 3;
      int divisor = 2;

      double result = dividend / divisor * 1.0;
      System.out.println(result);
    #+end_src

    #+RESULTS[971149dc100a21d2afc800cbe089a152e37a1f45]:
    #+begin_resultscode
    1.0
    #+end_resultscode

    #+LaTeX: }
